STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
MRSubG_PcktBasicFields MRSUBG_PacketSettingsStruct = {0};

volatile FlagStatus xTxDoneFlag = RESET;
volatile FlagStatus xRxDoneFlag = RESET;
volatile FlagStatus xSabortCompletedFlag = RESET;

static uint8_t WmBus_Auto_Rx = 0;                                                        /**< Variable to relaunch Rx automatically: 0= not automatically relaunched, 1 = automatically relaunched */
static uint8_t vectcRadioBuff[WMBUS_RADIO_BUFFER_SIZE + WMBUS_RADIO_BUFFER_SIZE_MARGIN]; /**< Radio buffer directly connected to Radio IP */
static uint8_t vectcRadioBuff_copy[WMBUS_RADIO_BUFFER_SIZE_MAX_NRZ];                     /**< Radio buffer copy - used for vectcRadioBuff[] buffer manipulation - especially if T1C1_ACTIVATED */

volatile uint8_t xRxState = SM_RX_NEW_PACKET;

static uint16_t RssiOnSync = 0; /**< Rssi level measured once Sync is done */
static uint16_t RssiRxDone = 0; /**< RssiOnSync to be copied into RssiRxDone at the end of reception */

static uint32_t RxSync_Ongoing = 0; /**< Save Sync pattern during Rx */
static uint32_t RxSync_RxDone = 0;  /**< RxSync_Ongoing to be copied into RxSync_RxDone at the end of reception */

static uint8_t cLField; /**< L-field value */

static uint16_t nPcktLength = 0; /**< Packet length variable*/
#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE)
static uint16_t nPcktLengthRaw = 0; /**< Packet length variable for T1C1 mode */
#endif

static uint8_t Hal_MrSubGhz_WmBus_mode = 0;      /*< Hal copy of WmBus configuration - mode */
static uint8_t Hal_MrSubGhz_WmBus_direction = 0; /*< Hal copy of WmBus configuration - direction */
static uint8_t Hal_MrSubGhz_Frame_format = 0;    /*< Hal copy of WmBus configuration - frame format */

static uint32_t WmBus_Radio_Event_bitmap = 0; /**< Bitmap of WmBus Radio events */

static uint8_t *HAL_buffer_ptr;        /**< HAL buffer pointer */
static uint16_t *HAL_buffer_size_ptr;  /**< HAL buffer size pointer */
static uint16_t HAL_buffer_allocation; /**< HAL buffer allocation */
static uint8_t *HAL_buffer_format_ptr; /**< HAL buffer format pointer */
static int32_t *HAL_RssiDbm_ptr;       /**< HAL RSSI pointer */
static uint32_t *HAL_WmBus_RxSync_ptr; /**< HAL Rx Sync pointer */

#ifdef WMBUS_DEBUG
static uint8_t MRSubG_WmBus_debug_log_index = 0;                     /**< Index of the debug log buffer */
static wmbphy_debug_t MRSubG_WmBus_debug_log[WMBUS_LOG_BUFFER_SIZE]; /**< Debug log buffer */
#endif
/**
 * @}
 */

/** @defgroup RADIO_Private_Functions RADIO Private Functions
 * @{
 */
#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
extern int adjustFrequencyBaseFor169(void);
extern void revertFrequencyBaseFor169(void);
#endif
extern void FEM_Operation(FEM_OperationType operation);
#endif
static uint8_t wmbphy_GetAllowedMaxOutputPower(MRSubG_PA_DRVMode paMode);
static int32_t wmbphy_ConvertRssiToDbm(uint16_t rssi_level_from_register);

/**
 * @brief Convert RSSI_LEVEL_ON_SYNC to dBm.
 * @param rssi_level_from_register the value to convert.
 * @retval The converted RSSI level in dBm.
 */
static int32_t wmbphy_ConvertRssiToDbm(uint16_t rssi_level_from_register) {
    return (rssi_level_from_register / 2) - (96 + GAIN_RX_CHAIN);
}

/**
 * @brief  Returns the maximum allowed output power supported by the specific configuration.
 * @param  paDrvMode the configuration type.
 * @retval The maximum output power.
 */
static uint8_t wmbphy_GetAllowedMaxOutputPower(MRSubG_PA_DRVMode paDrvMode) {
    uint8_t retPwr = 20;

    switch (paDrvMode) {
        case PA_DRV_TX:
            retPwr = 10;
            break;
        case PA_DRV_TX_HP:
            retPwr = 14;
            break;
        case PA_DRV_TX_TX_HP:
            retPwr = 18; /* Max allowed power without PA_DEGEN_ON */
            break;
    }

    return retPwr;
}
/**
 * @}
 */

/** @defgroup RADIO_Exported_Functions RADIO Exported Functions
 * @{
 */
#ifndef WMBUS_DIRECT_REGISTER_INIT
/**
 * @brief Initializes the WmBus phy with the specified mode, direction, and format.
 * @note  This function is defined when the WMBUS_DIRECT_REGISTER_INIT is not defined.
 * @param WmBus_mode mode of WmBus.
 * @param WmBus_Direction direction of WmBus.
 * @param WmBus_Format format of WmBus.
 * @retval None.
 */
void wmbphy_init(uint8_t WmBus_mode, uint8_t WmBus_Direction, uint8_t WmBus_Format) {
    /* Configures the radio parameters */
    MRSUBG_RadioInitStruct.lFrequencyBase = WmBus_Frequency[WmBus_mode][WmBus_Direction];
    MRSUBG_RadioInitStruct.xModulationSelect = WmBus_Modulation[WmBus_mode][WmBus_Direction];
    MRSUBG_RadioInitStruct.lDatarate = WmBus_Datarate[WmBus_mode][WmBus_Direction];
    MRSUBG_RadioInitStruct.lFreqDev = WmBus_FreqDev[WmBus_mode][WmBus_Direction];
    MRSUBG_RadioInitStruct.lBandwidth = WmBus_ChannelBandwidth[WmBus_mode][WmBus_Direction];
    MRSUBG_RadioInitStruct.dsssExp = 0;
    /* +10dBm Tx output power */
#ifdef IS_169MHZ
    MRSUBG_RadioInitStruct.outputPower = -8;
#else
    MRSUBG_RadioInitStruct.outputPower = 10;
#endif

    HAL_MRSubG_Init(&MRSUBG_RadioInitStruct);

    /* Configures the packet parameters */
    MRSUBG_PacketSettingsStruct.PreambleLength = WmBus_PreambleLength[WmBus_mode][WmBus_Direction];
    MRSUBG_PacketSettingsStruct.PostambleLength = PREAMBLE_BYTE(0);
    /* set Tx and Rx Sync settings - by default same but can be different in some special cases */
    MRSUBG_PacketSettingsStruct.SyncLength = WmBus_SyncLength[WmBus_mode][WmBus_Direction] - 1;
    MRSUBG_PacketSettingsStruct.SyncWord = WmBus_SyncPattern[WmBus_mode][WmBus_Direction];

    if (WmBus_mode == N_MODE_Ng) {
        /* specific configuration for Sync pattern : need to force 2-FSK SYnc pattern : set FORCE_2FSK_SYNC_MODE */
        SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE);
    }

    /* special Sync settings if needed */
    /* case C-mode & Format B */
    if ((WmBus_Format == WMBUS_FORMAT_B) && (WmBus_mode == C_MODE)) {
        MRSUBG_PacketSettingsStruct.SyncWord = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B;
    }

    MRSUBG_PacketSettingsStruct.FixVarLength = FIXED;
    MRSUBG_PacketSettingsStruct.PreambleSequence = PRE_SEQ_0101;
    MRSUBG_PacketSettingsStruct.PostambleSequence = POST_SEQ_0101;
    MRSUBG_PacketSettingsStruct.CrcMode = PKT_NO_CRC;
    MRSUBG_PacketSettingsStruct.Coding = WmBus_ChannelCoding[WmBus_mode][WmBus_Direction];
    /* set Manchester type1 if needed */
    if (MRSUBG_PacketSettingsStruct.Coding == CODING_MANCHESTER) {
        LL_MRSubG_PacketHandlerManchesterType(MANCHESTER_TYPE1);
    }
    MRSUBG_PacketSettingsStruct.DataWhitening = DISABLE;
    MRSUBG_PacketSettingsStruct.LengthWidth = BYTE_LEN_1;
    MRSUBG_PacketSettingsStruct.SyncPresent = ENABLE;

    /* in that case - ONLY FOR GATEWAY - special settings to be used */
#ifdef T1C1_ACTIVATED
    if ((WmBus_mode == C_MODE) || (WmBus_mode == T_MODE)) {
        /* only Rx Sync settings to change */
        /* use different Sync pattern to cope with T1 AND C1 */
        MRSUBG_PacketSettingsStruct.SyncWord = WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY;
        MRSUBG_PacketSettingsStruct.SyncLength = WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1;

        /* force NRZ decoding */
        MRSUBG_PacketSettingsStruct.Coding = CODING_NONE;
    }
#endif

