STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
    /* set maximum packet length to avoid corrupting Radio buffer*/
    HAL_MRSubG_PktBasicSetPayloadLength(WMBUS_RADIO_BUFFER_SIZE);

    /* Configure Output Power */
    HAL_MRSubG_SetPALeveldBm(7, MRSUBG_RadioInitStruct.outputPower, PA_DRV_TX_HP);

    /* check back */
    MRSUBG_RadioInitStruct.outputPower = HAL_MRSubG_GetPALeveldBm();

#ifdef WMBUS_RX_PERFORMANCE_ENABLED
    /* activate Rx performance settings - may depend on Wm-Bus mode */
    wmbphy_Rx_performance_settings(WmBus_mode, WmBus_Direction);
#endif

#if 0  
    /* IRQ Config */
  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E;

  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E;

  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E;

#endif
    HAL_NVIC_EnableIRQ(MR_SUBG_IRQn);

    HAL_NVIC_ClearPendingIRQ(MR_SUBG_IRQn);

    /* clear IRQ flags */
    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = 0xffffffff;

    /* Set the pointer to the data buffer */
    MR_SUBG_GLOB_STATIC->DATABUFFER0_PTR = (uint32_t)&vectcRadioBuff;

    /* memorize frame format */
    Hal_MrSubGhz_Frame_format = WmBus_Format;
    /* memorize Wm-Bus mode */
    Hal_MrSubGhz_WmBus_mode = WmBus_mode;
    /* memorize Wm-Bus direction */
    Hal_MrSubGhz_WmBus_direction = WmBus_Direction;

#ifdef WMBUS_DEBUG
    wmbphy_initialize_debug_log();
#endif
}

/**
 * @brief Initializes the WmBus phy for C-mode Meter to Other using directly the registers.
 * @note  This function is defined when the WMBUS_DIRECT_REGISTER_INIT is defined.
 *        Here mode, direction, and format are used only for Rx performance settings.
 * @param WmBus_mode mode of WmBus.
 * @param WmBus_Direction direction of WmBus.
 * @param WmBus_Format format of WmBus.
 * @retval None.
 */
void wmbphy_init_Cmode_M2O(uint8_t WmBus_mode, uint8_t WmBus_Direction, uint8_t WmBus_Format) {
    if (__HAL_RCC_MRSUBG_IS_CLK_DISABLED()) {
        /* Radio Peripheral reset */
        __HAL_RCC_MRSUBG_FORCE_RESET();
        __HAL_RCC_MRSUBG_RELEASE_RESET();

        /* Enable Radio peripheral clock */
        __HAL_RCC_MRSUBG_CLK_ENABLE();
    }

    /* Setup design values for default registers */
    MODIFY_REG_FIELD(MR_SUBG_RADIO->AFC1_CONFIG, MR_SUBG_RADIO_AFC1_CONFIG_AFC_FAST_PERIOD, 0x00);

    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR, 0x62);

    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN, 0x01);
    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST, 0x03);
    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST, 0x08);

    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL1, MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_ALGO_SEL, 0x00);
    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL1, MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW, 0x05);
    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL1, MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW, 0x0C);

    /* optimize Clock Recovery settings */
    WRITE_REG(MR_SUBG_RADIO->CLKREC_CTRL0, 0x98);
    WRITE_REG(MR_SUBG_RADIO->CLKREC_CTRL1, 0x18);

    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL, MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS, 0x03);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL, MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW, 0x04);

    /* Enable calibration */
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->VCO_CAL_CONFIG, MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ);

    /* Avoid AGC glitches */
    WRITE_REG(MR_SUBG_RADIO->RF_FSM7_TIMEOUT, 0x0F);

    // HAL_MRSubG_SetFrequencyBase()
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT, 0x48);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC, 0x00069999);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->ADDITIONAL_CTRL, MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM, 0x00);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->SYNTH_FREQ, MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS, 0x00);

    // HAL_MRSubG_SetModulation
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL, 0x00);
    // MODIFY_REG_FIELD(MR_SUBG_RADIO->CLKREC_CTRL0, MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN, 0x01);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL, 0);

    // MRSUBG_EvaluateDSSS
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL, MR_SUBG_GLOB_STATIC_DSSS_CTRL_DSSS_EN, 0x00);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL,  MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP, 0x00);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->DSSS_CTRL,  MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR, 0x00);

    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE, 0x00);

    // HAL_MRSubG_SetDatarate
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M, 0x999A);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E, 0x09);

    // HAL_MRSubG_SetFrequencyDev
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M, 0xEC);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E, 0x04);

    // HAL_MRSubG_SetChannelBW
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M, 0x00);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E, 0x03);

    CLEAR_BIT(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE);

    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA, 0x000004C4);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->IF_CTRL, MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG, 0x000004C4);

    // HAL_MRSubG_SetPALeveldBm
    SET_BIT(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE, 0x00);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE, 0x02);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX, 0x07);

    WRITE_REG(MR_SUBG_GLOB_STATIC->PA_LEVEL_3_0, 0x21170D03);
    WRITE_REG(MR_SUBG_GLOB_STATIC->PA_LEVEL_7_4, 0x493F352B);

    // HAL_MRSubG_PacketBasicInit
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT, PKT_BASIC);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT, 0x01FF);

    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT, ENABLE);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN, 0x1F);
    WRITE_REG(MR_SUBG_GLOB_STATIC->SYNC, 0x543D54CD);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL, DISABLE);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH, 0x0C);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ, 0x00);
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL, CODING_NONE);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE, PKT_NO_CRC);
    // MODIFY_REG(MR_SUBG_GLOB_STATIC->CRC_INIT, MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL, 0xFFFFFFFF);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN, FIXED);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH, BYTE_LEN_1);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH, 0x00);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ, POST_SEQ_0101);

    /* set RSSI_FLT register */
    WRITE_REG(MR_SUBG_RADIO->RSSI_FLT, 0xE3);

    /* optimize AFC3 register to avoid residual PER */
    WRITE_REG(MR_SUBG_RADIO->AFC3_CONFIG, 0xE9);

