STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_PCKT_FORMAT, PKT_BASIC);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT, 0x01FF);

    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT, ENABLE);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN, 0x11);
    WRITE_REG(MR_SUBG_GLOB_STATIC->SYNC, 0x1DA58000);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL, DISABLE);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH, 0x0F);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ, 0x00);
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL, CODING_MANCHESTER);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE, PKT_NO_CRC);
    // MODIFY_REG(MR_SUBG_GLOB_STATIC->CRC_INIT, MR_SUBG_GLOB_STATIC_CRC_INIT_CRC_INIT_VAL, 0xFFFFFFFF);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN, FIXED);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH, BYTE_LEN_1);
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH, 0x00);
    // MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ, POST_SEQ_0101);

    /* set RSSI_FLT register */
    WRITE_REG(MR_SUBG_RADIO->RSSI_FLT, 0xE3);

    /* optimize AFC3 register to avoid residual PER */
    WRITE_REG(MR_SUBG_RADIO->AFC3_CONFIG, 0xE9);

    /* set maximum packet length to avoid corrupting Radio buffer*/
    HAL_MRSubG_PktBasicSetPayloadLength(WMBUS_RADIO_BUFFER_SIZE);

    /* Configure Output Power */
    HAL_MRSubG_SetPALeveldBm(7, MRSUBG_RadioInitStruct.outputPower, PA_DRV_TX_HP);

    /* check back */
    MRSUBG_RadioInitStruct.outputPower = HAL_MRSubG_GetPALeveldBm();

#ifdef WMBUS_RX_PERFORMANCE_ENABLED
    /* activate Rx performance settings - may depend on Wm-Bus mode */
    wmbphy_Rx_performance_settings(WmBus_mode, WmBus_Direction);
#endif

#if 0  
    /* IRQ Config */
  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E;

  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E;

  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

  MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E;

#endif
    HAL_NVIC_EnableIRQ(MR_SUBG_IRQn);

    HAL_NVIC_ClearPendingIRQ(MR_SUBG_IRQn);

    /* clear IRQ flags */
    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = 0xffffffff;

    /* Set the pointer to the data buffer */
    MR_SUBG_GLOB_STATIC->DATABUFFER0_PTR = (uint32_t)&vectcRadioBuff;

    /* memorize frame format */
    Hal_MrSubGhz_Frame_format = WmBus_Format;
    /* memorize Wm-Bus mode */
    Hal_MrSubGhz_WmBus_mode = WmBus_mode;
    /* memorize Wm-Bus direction */
    Hal_MrSubGhz_WmBus_direction = WmBus_Direction;

#ifdef WMBUS_DEBUG
    wmbphy_initialize_debug_log();
#endif
}
#endif

/**
 * @brief  Prepare WmBus phy for transmission by setting up the TX buffer and its size.
 * @param  WmBus_TxBuffer Pointer to the TX buffer.
 * @param  WmBusTxBuffer_size Size of the TX buffer.
 * @retval None.
 */
void wmbphy_prepare_Tx(uint8_t *WmBus_TxBuffer, uint16_t WmBusTxBuffer_size) {
    /* IRQ Config */

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = 0;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

    /* should align to PHY layer buffer which is 32-bit aligned : vectcRadioBuff */
    uint16_t i = 0;

    uint8_t *local_WmBus_Buffer_ptr = WmBus_TxBuffer;

    for (i = 0; i < WmBusTxBuffer_size; i++) {
        vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
        local_WmBus_Buffer_ptr++;
    }

    /* specify Tx mode Normal */
    LL_MRSubG_SetTXMode(TX_NORMAL);

    /* do not forget to specify packet length as using packet handler */
    HAL_MRSubG_PktBasicSetPayloadLength(WmBusTxBuffer_size);
}
#ifdef WMBUS_CRC_IN_HAL
/**
 * @brief  Prepare WmBus phy for transmission with CRC management by setting up the TX buffer, its size, and the frame format.
 * @note   This function is defined when the WMBUS_CRC_IN_HAL is defined.
 * @param  WmBus_TxBuffer Pointer to the TX buffer.
 * @param  WmBusTxBuffer_size Size of the TX buffer.
 * @param  FrameFormat Format of the frame.
 * @retval None.
 */
void wmbphy_prepare_Tx_CRC_mngt(uint8_t *WmBus_TxBuffer, uint16_t WmBusTxBuffer_size, uint8_t FrameFormat) {
    /* IRQ Config */

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = 0;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

    /* should align to PHY layer buffer which is 32-bit aligned : vectcRadioBuff */
    uint16_t i = 0;
    uint16_t radio_buffer_index = 0;
    uint8_t dataBytesRemaining;
    uint8_t blockDataSize;
    uint8_t *local_WmBus_Buffer_ptr = WmBus_TxBuffer;

    /* WmBusTxBuffer_size is buffer size without CRCs */
    dataBytesRemaining = WmBusTxBuffer_size;

    if (FrameFormat == WMBUS_FORMAT_A) {
        /* copy 1st block data into Radio buffer */
        for (i = 0; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2); i++) {
            vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
            local_WmBus_Buffer_ptr++;
        }

        /* manage CRC of 1st block : After adding 2 byte CRC */
        wmbphy_CRC_append(&vectcRadioBuff[0], &vectcRadioBuff[i]);
        /* update vectcRadioBuff index */
        i = i + 2;

        /* update remaining bytes */
        dataBytesRemaining = dataBytesRemaining - (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2);

        /* Copy 0-16 bytes of data in the second block : determine nb of bytes to copy */
        // blockDataSize = MIN(dataBytesRemaining, (WMBUS_BLOCK_SIZE_FORMAT_A - 2));
        if (dataBytesRemaining <= (WMBUS_BLOCK_SIZE_FORMAT_A - 2)) {
            blockDataSize = dataBytesRemaining;
        } else {
            blockDataSize = (WMBUS_BLOCK_SIZE_FORMAT_A - 2);
        }

        /* copy 2st block data into Radio buffer */
        for (i = WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A + blockDataSize); i++) {
            vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
            local_WmBus_Buffer_ptr++;
        }

