STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
        /* manage CRC of 2nd block : After adding 2 byte CRC */
        wmbphy_CRC_append(&vectcRadioBuff[WMBUS_FIRST_BLOCK_SIZE_FORMAT_A], &vectcRadioBuff[i]);
        /* update vectcRadioBuff index */
        i = i + 2;

        /* update remaining bytes */
        dataBytesRemaining = dataBytesRemaining - blockDataSize;

        /* Assemble optional blocks */
        while (dataBytesRemaining) {
            /* ease index management */
            radio_buffer_index = i;

            /* Copy 0-16 bytes of data into the next block */
            // blockDataSize = MIN(dataBytesRemaining, (WMBUS_BLOCK_SIZE_FORMAT_A - 2));
            if (dataBytesRemaining <= (WMBUS_BLOCK_SIZE_FORMAT_A - 2)) {
                blockDataSize = dataBytesRemaining;
            } else {
                blockDataSize = (WMBUS_BLOCK_SIZE_FORMAT_A - 2);
            }

            /* Data-field (Data) - Application payload */
            /* copy nth block data into Radio buffer */
            for (i = radio_buffer_index; i < radio_buffer_index + blockDataSize; i++) {
                vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
                local_WmBus_Buffer_ptr++;
            }

            /* manage CRC of 2nd block : After adding 2 byte CRC */
            wmbphy_CRC_append(&vectcRadioBuff[radio_buffer_index], &vectcRadioBuff[i]);

            /* update vectcRadioBuff index */
            i = i + 2;

            dataBytesRemaining -= blockDataSize;
        }

    } else if (FrameFormat == WMBUS_FORMAT_B) {
        /* adapt L-field according to B format : without CRC for the time being...*/
        /* depends on the size of Wm-Bus packet : either +2 CRC bytes or +4 */
        if (WmBusTxBuffer_size <= WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2) {
            vectcRadioBuff[0] = WmBusTxBuffer_size - 1 + 2;
        } else {
            vectcRadioBuff[0] = WmBusTxBuffer_size - 1 + 4;
        }

        /* skit first byte which is supposed to be L-field */
        local_WmBus_Buffer_ptr++;

        /* copy 1st block data into Radio buffer */
        for (i = 1; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B); i++) {
            vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
            local_WmBus_Buffer_ptr++;
        }

        /* no CRC in 1st block - Format B */

        /* update remaining bytes */
        dataBytesRemaining = dataBytesRemaining - (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B);

        /* Copy 0-116 bytes of data in the second block : determine nb of bytes to copy */
        // blockDataSize = MIN(dataBytesRemaining, (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2));
        if (dataBytesRemaining <= (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2)) {
            blockDataSize = dataBytesRemaining;
        } else {
            blockDataSize = (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2);
        }

        /* copy 2st block data into Radio buffer */
        for (i = WMBUS_FIRST_BLOCK_SIZE_FORMAT_B; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + blockDataSize); i++) {
            vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
            local_WmBus_Buffer_ptr++;
        }

        /* manage CRC of 2nd block : After adding 2 byte CRC */
        wmbphy_CRC_append(&vectcRadioBuff[0], &vectcRadioBuff[i]);
        /* update vectcRadioBuff index */
        i = i + 2;

        /* update remaining bytes */
        dataBytesRemaining = dataBytesRemaining - blockDataSize;

        /* Assemble optional blocks */
        while (dataBytesRemaining) {
            /* ease index management */
            radio_buffer_index = i;

            /* Copy 0-16 bytes of data into the next block */
            // blockDataSize = MIN(dataBytesRemaining, (WMBUS_BLOCK_SIZE_FORMAT_A - 2));
            if (dataBytesRemaining <= (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2)) {
                blockDataSize = dataBytesRemaining;
            } else {
                blockDataSize = (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2);
            }

            /* Data-field (Data) - Application payload */
            /* copy nth block data into Radio buffer */
            for (i = radio_buffer_index; i < radio_buffer_index + blockDataSize; i++) {
                vectcRadioBuff[i] = *(local_WmBus_Buffer_ptr);
                local_WmBus_Buffer_ptr++;
            }

            /* manage CRC of 2nd block : After adding 2 byte CRC */
            wmbphy_CRC_append(&vectcRadioBuff[radio_buffer_index], &vectcRadioBuff[i]);

            /* update vectcRadioBuff index */
            i = i + 2;

            dataBytesRemaining -= blockDataSize;
        }
    }
    /* specify Tx mode Normal */
    LL_MRSubG_SetTXMode(TX_NORMAL);

    /* ease index management */
    radio_buffer_index = i;

    /* do not forget to specify packet length as using packet handler */
    HAL_MRSubG_PktBasicSetPayloadLength(radio_buffer_index);
}
#endif

/**
 * @brief  Prepare WmBus phy for reception.
 * @retval None.
 */
void wmbphy_prepare_Rx(void) {
    /* IRQ Config */
    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = 0;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E;

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

#ifdef PREAMBLE_AND_SYNC_IRQ_ENABLE
    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SYNC_VALID_E;

    /* by default set to 8 bits preamble verification */
    LL_wmbphy_set_PQI_thr(0x02);

    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_PREAMBLE_VALID_E;
#endif

    /* specify Rx mode Normal */
    LL_MRSubG_SetRXMode(RX_NORMAL);

    /* do not forget to specify maximum Rx packet length as using packet handler */
    HAL_MRSubG_PktBasicSetPayloadLength(WMBUS_RADIO_BUFFER_SIZE);

#ifndef WMBUS_FIRST_CRC_CHECK
    /* initialize Rx buffer threshold to xx bytes - size of max of 1st block size :format A */
    LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_BLOCK_SIZE_FORMAT_A);
#else
    /* initialize Rx buffer threshold to xx bytes - size of max number of bytes to include CRC - format A */
    LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
#endif

    // HAL_MRSubG_SetRSSIThreshold(RSSI_THRESHOLD);

#if defined(T1C1_ACTIVATED_C1_MODE)
    if (Hal_MrSubGhz_WmBus_mode == C_MODE) {
        /* only Rx Sync settings to change */
        /* use different Sync pattern to cope with T1 AND C1 */
        LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY);
        LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1);

        /* force NRZ decoding */
        LL_MRSubG_PacketHandlerCoding(CODING_NONE);
    }
#endif
#if defined(T1C1_ACTIVATED)
    if ((Hal_MrSubGhz_WmBus_mode == C_MODE) || (Hal_MrSubGhz_WmBus_mode == T_MODE)) {
        /* only Rx Sync settings to change */
        /* use different Sync pattern to cope with T1 AND C1 */
        LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY);
        LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1);

        /* force NRZ decoding */
        LL_MRSubG_PacketHandlerCoding(CODING_NONE);
    }
#endif

#ifdef AUTOMATIC_FORMAT_DETECTION_C_MODE
    /* check if C-mode Rx is activated and enable dynamic frame format reception */
    if (Hal_MrSubGhz_WmBus_mode == C_MODE) {
        switch (Hal_MrSubGhz_Frame_format) {
            /* frame format is undefined */
            case WMBUS_FORMAT_A_B:

                /* check if T1C1_ACTIVATED_C1_MODE is activated */
#ifdef T1C1_ACTIVATED_C1_MODE

                /* in that case activate different C-mode Sync pattern & length */
                LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY);
                LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1);

#else

                /* in that case activate different C-mode Sync pattern & length */
                LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_UNDEFINED);
                LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_C_MODE_M2O_FORMAT_UNDEFINED - 1);
#endif

                break;

            case WMBUS_FORMAT_A:
            case WMBUS_FORMAT_B:

                /* nothing to do - already done */
                break;

            default:

                break;
        }
    }

#endif

    /* initialize Rx state machine */
    xRxState = SM_RX_NEW_PACKET;

    /* force automatic Rx */
    WmBus_Auto_Rx = 1;
}

/**
 * @brief  Start WmBus phy transmission.
 * @retval uint8_t Status of the transmission start.
 */
uint8_t wmbphy_start_transmission(void) {
    __HAL_MRSUBG_STROBE_CMD(CMD_TX);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_TX_LOG, 0, 0, 0);
#endif

    return SUCCESS;
}

/**
 * @brief  Start WmBus phy continuous reception.
 * @retval uint8_t Status of the reception start.
 */
uint8_t wmbphy_start_continuousRx(void) {
    /* force automatic Rx */
    WmBus_Auto_Rx = 1;

