STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
    /* Call this API before RX */
    adjustFrequencyBaseFor169();
#endif
    /* Restart RX */
    FEM_Operation(FEM_RX);
#endif

    __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_RX_CONTINUOUS_LOG, 0, 0, 0);
#endif

    return SUCCESS;
}

/**
 * @brief  Start WmBus phy reception with a timeout.
 * @param  RxTimeoutMicrosec Timeout value in microseconds.
 * @param  RxTimeoutStopCondition Stop condition for the timeout.
 * @retval uint8_t Status of the reception start.
 */
uint8_t wmbphy_start_RxTimer(uint32_t RxTimeoutMicrosec, uint8_t RxTimeoutStopCondition) {
    uint32_t RxTimerReg = 0;

    /* force automatic Rx */
    WmBus_Auto_Rx = 0;

    /* compute Rx timer value */
    RxTimerReg = HAL_MRSubG_Sequencer_Microseconds(RxTimeoutMicrosec);

    /* write Rx timer Register */
    MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT, RxTimerReg);

    /* set Stop timeout conditions */
    if (RxTimeoutStopCondition & RX_CS_TIMEOUT_MASK == RX_CS_TIMEOUT_MASK) {
        LL_MRSubG_SetRxCsTimeout(ENABLE);
    } else {
        LL_MRSubG_SetRxCsTimeout(DISABLE);
    }

    if (RxTimeoutStopCondition & RX_PQI_TIMEOUT_MASK == RX_PQI_TIMEOUT_MASK) {
        LL_MRSubG_SetRxPqiTimeout(ENABLE);
    } else {
        LL_MRSubG_SetRxPqiTimeout(DISABLE);
    }

    if (RxTimeoutStopCondition & RX_SQI_TIMEOUT_MASK == RX_SQI_TIMEOUT_MASK) {
        LL_MRSubG_SetRxSqiTimeout(ENABLE);
    } else {
        LL_MRSubG_SetRxSqiTimeout(DISABLE);
    }

    if (RxTimeoutStopCondition & RX_OR_nAND_SELECT == RX_OR_nAND_SELECT) {
        LL_MRSubG_SetRxOrnAndSelect(ENABLE);
    } else {
        LL_MRSubG_SetRxOrnAndSelect(DISABLE);
    }

#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
    /* Call this API before RX */
    adjustFrequencyBaseFor169();
#endif
    /* Restart RX */
    FEM_Operation(FEM_RX);
#endif

    __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_RX_TIMER_LOG, 0, 0, 0);
#endif

    return SUCCESS;
}

/**
 * @brief  Abort WmBus phy reception.
 * @retval None.
 */
void wmbphy_abort(void) {
    /* disable automatic Rx */
    WmBus_Auto_Rx = 0;

    /* send sabort command to Radio IP */
    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

    /* here need a smarter management :
       - either wait for Sabort Flag - if compilation switch activated
       - or check Radio FSM (already) in Idle mode
    */

    /* wait for SABORT IRQ confirmation or Radio FSM state Idle */
    while ((!xSabortCompletedFlag) && (LL_MRSubG_GetRadioFSMState() != STATE_IDLE));

    xSabortCompletedFlag = RESET;
}

#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE)
/**
 * @brief  Decode T1+C1 mode by Sw - gateway only case.
 * @note   This function is defined when T1C1_ACTIVATED or T1C1_ACTIVATED_C1_MODE is defined.
 * @param  tos_in Pointer to the input buffer.
 * @param  tos_out Pointer to the output buffer.
 * @retval uint8_t size of the output buffer.
 */
static uint8_t ToS_decode(uint8_t *tos_in, uint8_t *tos_out) {
    uint8_t nibble;
    uint16_t semioct;
    uint8_t size = 0;

    tos_out[0] = 0;
    tos_out[1] = 0;

    for (uint8_t j = 0; j < 4; j++) {
        switch (j) {
            case 0:
                nibble = tos_in[0] >> 2;
                break;
            case 1:
                nibble = ((tos_in[0] & 0x03) << 4) + (tos_in[1] >> 4);
                break;
            case 2:
                nibble = ((tos_in[1] & 0x0F) << 2) + (tos_in[2] >> 6);
                break;
            case 3:
                nibble = tos_in[2] & 0x3F;
                break;
        }

        switch (nibble) {
            case 22:
                semioct = 0;
                break;
            case 13:
                semioct = 1;
                break;
            case 14:
                semioct = 2;
                break;
            case 11:
                semioct = 3;
                break;
            case 28:
                semioct = 4;
                break;
            case 25:
                semioct = 5;
                break;
            case 26:
                semioct = 6;
                break;
            case 19:
                semioct = 7;
                break;
            case 44:
                semioct = 8;
                break;
            case 37:
                semioct = 9;
                break;
            case 38:
                semioct = 10;
                break;
            case 35:
                semioct = 11;
                break;
            case 52:
                semioct = 12;
                break;
            case 49:
                semioct = 13;
                break;
            case 50:
                semioct = 14;
                break;
            case 41:
                semioct = 15;
                break;
            default:
                return size;
        }

        tos_out[j >> 1] |= (semioct << (4 * ((j % 2) == 0)));

        if (j == 1 || j == 3) size++;
    }

    return size;
}

/* Static variables to be used in WmBus Rx IRQ handler to decode T-mode by Sw using T1C1_ACTIVATED */
static uint16_t tos_q_head = 0, tos_q_tail = 0, tos_q_done_head = 0, tos_q_done_tail = 0;
uint8_t tos_out[2], tos_in[3];
#endif

/* initially declared in stm32wl3x_it.h */
extern void MRSUBG_APP_IRQHandler(void);

/**
 * @brief  Interrupt handler for MRSUBG application.
 * @retval None.
 */
void MRSUBG_APP_IRQHandler(void) {
    uint32_t irq;

    irq = READ_REG(MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS);

    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F) {
        /* Clear the IRQ flag */
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F;

#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_IRQ_TX_DONE_LOG, 0, 0, 0);
#endif

#ifndef WMBUS_NO_BLOCKING_HAL
        /* set the tx_done_flag to manage the event in the main() */
        xTxDoneFlag = SET;
#else
        WmBus_Radio_Event_bitmap |= WMBUS_TX_COMPLETED;
#endif
    }

    /* check SABORT DONE IRQ */
    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F) {
        /* Clear the IRQ flag */
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F;

#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_IRQ_ABORT_LOG, WmBus_Auto_Rx, 0, 0);
#endif

        if (WmBus_Auto_Rx == 1) {
#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
            /* Call this API after RX */
            revertFrequencyBaseFor169();
#endif
#endif

            /* initialize Rx state machine */
            xRxState = SM_RX_NEW_PACKET;

#ifndef WMBUS_FIRST_CRC_CHECK
            /* initialize Rx buffer threshold to xx bytes - size of max of 1st block size :format A */
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_BLOCK_SIZE_FORMAT_A);
#else
            /* initialize Rx buffer threshold to xx bytes - size of max number of bytes to include CRC - format A */
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
#endif

