STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
            /* Call this API before RX */
            adjustFrequencyBaseFor169();
#endif
            /* Restart RX */
            FEM_Operation(FEM_RX);
#endif

            /* if sabort done then issue Rx command */
            __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
            wmbphy_trace_debug_log(DEBUG_COMMAND_RX_CONTINUOUS_LOG, 0, 0, 0);
#endif
        } else {
            /* indicate flag status */
            xSabortCompletedFlag = SET;
        }
    }

    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F) {
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F;

#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
        /* Call this API after RX */
        revertFrequencyBaseFor169();
#endif
#endif

#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_IRQ_RX_TIMER_LOG, 0, 0, 0);
#endif

        WmBus_Radio_Event_bitmap |= WMBUS_RX_TIMEOUT;
    }

    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F) {
        // MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_IRQ_RX_FIFO_LOG, 0, 0, 0);
#endif
        /* flag to set Sabort command to issue as multiple Sabort cases to handle */
        // uint8_t Sabort_Cmd_Prog = 0;

        if (xRxState == SM_RX_NEW_PACKET) {
            RssiOnSync = READ_REG_FIELD(MR_SUBG_GLOB_STATUS->RX_INDICATOR, MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC);
            // RssiOnSync = READ_REG_FIELD(MR_SUBG_GLOB_STATUS->RX_INDICATOR, MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_RUN);
            /* save Sync pattern - upper layer purpose */
            RxSync_Ongoing = LL_MRSubG_GetSyncWord();

#if !defined(T1C1_ACTIVATED) && !defined(T1C1_ACTIVATED_C1_MODE)
#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
            /* extract L-field */
            cLField = vectcRadioBuff[0];

            if (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A) {
                nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
                *(HAL_buffer_format_ptr) = WMBUS_FORMAT_A;
            }
            if (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_B) {
                nPcktLength = 1 + cLField;
                *(HAL_buffer_format_ptr) = WMBUS_FORMAT_B;
            }
#else  // #ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
            /* manage dynamic C-mode detection */
            /* to be checked which C-mode frame format it is */
            /* only if C-mode is activated and frame format WMBUS_FORMAT_A_B (undefined) */
            if ((Hal_MrSubGhz_WmBus_mode == C_MODE) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A_B)) {
                if (vectcRadioBuff[0] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A & 0x000000FF)) {
                    RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A;
                    *(HAL_buffer_format_ptr) = WMBUS_FORMAT_A;

                } else if (vectcRadioBuff[0] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B & 0x000000FF)) {
                    RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B;
                    *(HAL_buffer_format_ptr) = WMBUS_FORMAT_B;

                } else {
                    /* here there is an error and we should stop reception */
                    /* Clear the IRQ flag */
                    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_C_MODE, vectcRadioBuff[0], 0, 0);
#endif

                    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

#ifdef WMBUS_NO_BLOCKING_HAL
                    WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
#endif

                    // Sabort_Cmd_Prog = 1;
                    return;
                }

                /* here L-field is 2nd byte of Radio buffer - shifted by 1 */
                cLField = vectcRadioBuff[1];
                if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) {
                    nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
                }
                if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B) {
                    nPcktLength = 1 + cLField;
                }

            }  // if (Hal_MrSubGhz_WmBus_mode == C_MODE)
            else if ((Hal_MrSubGhz_WmBus_mode != C_MODE) || ((Hal_MrSubGhz_WmBus_mode == C_MODE) && (Hal_MrSubGhz_Frame_format != WMBUS_FORMAT_A_B)))
            /* here this normal case to handle : other than C-mode */
            {
                /* extract L-field */
                cLField = vectcRadioBuff[0];
                if (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A) {
                    nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
                    *(HAL_buffer_format_ptr) = WMBUS_FORMAT_A;
                }
                if (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_B) {
                    nPcktLength = 1 + cLField;
                    *(HAL_buffer_format_ptr) = WMBUS_FORMAT_B;
                }
            }
#endif
            /* L should be at least 10 or 11 depending frame format, otherwise abort */
            if (((cLField < 10) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A)) || ((cLField < 11) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_B))) {
                /* Clear the IRQ flag before return*/
                MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
                wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_L_FIELD, cLField, Hal_MrSubGhz_Frame_format, 0);
#endif

                __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif
#ifdef WMBUS_NO_BLOCKING_HAL
                WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
#endif
                return;
                // Sabort_Cmd_Prog = 1;
            } else {
#ifdef WMBUS_FIRST_CRC_CHECK
                if (!wmbphy_first_CRC_check()) {
                    /* if 1st CRC check is failed then stop Rx ASAP */
                    /* Clear the IRQ flag before return*/
                    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_FIRST_CRC_ERROR, cLField, Hal_MrSubGhz_Frame_format, 0);
#endif
                    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif
#ifdef WMBUS_NO_BLOCKING_HAL
                    WmBus_Radio_Event_bitmap |= WMBUS_FIRST_CRC_ERROR;
#endif
                    return;
                } else {
#endif
#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
                    /* update 2nd Rx buffer threshold */
#ifdef WMBUS_FIRST_CRC_CHECK
                    if (nPcktLength < WMBUS_FIRST_RXBUFFER_THRESHOLD) {
                        LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
                    } else {
                        LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
                    }
#else
                    LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
#endif
#else
                /* AUTOMATIC_FORMAT_DETECTION_C_MODE activated but check if C-mode & WMBUS_FORMAT_A_B */
                if ((Hal_MrSubGhz_WmBus_mode == C_MODE) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A_B)) {
#ifdef WMBUS_FIRST_CRC_CHECK
                    if (nPcktLength + 1 < WMBUS_FIRST_RXBUFFER_THRESHOLD) {
                        LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
                    } else {
                        LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 1);
                    }
#else
                    LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 1);
#endif
                } else {
#ifdef WMBUS_FIRST_CRC_CHECK
                    if (nPcktLength < WMBUS_FIRST_RXBUFFER_THRESHOLD) {
                        LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
                    } else {
                        LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
                    }
#else
                    LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
#endif
                }
#endif
                    xRxState = SM_RX_LAST;

#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_FISRT_PROCESSING, (uint32_t)nPcktLength, (uint32_t)RxSync_Ongoing, (uint32_t)RssiOnSync);
#endif
#ifdef WMBUS_FIRST_CRC_CHECK
                }
#endif
            }
#else /* T1C1 ACTIVATED or T1C1 ACTIVATED_C1_MODE*/
            /* to be checked whether C-Sync 3rd byte (0x54) or 3o6 T-mode byte */

            /* check T or C mode requested by application (as other modes can be also used with that Sw configuration) */
            if ((Hal_MrSubGhz_WmBus_mode == C_MODE) || (Hal_MrSubGhz_WmBus_mode == T_MODE)) {
                if (vectcRadioBuff[0] == ((WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A >> 8) & 0x000000FF)) {
                    /* to be checked which C-mode frame format it is */
                    if (vectcRadioBuff[1] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A & 0x000000FF)) {
                        RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A;
                        *(HAL_buffer_format_ptr) = WMBUS_FORMAT_A;

                    } else if (vectcRadioBuff[1] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B & 0x000000FF)) {
                        RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B;
                        *(HAL_buffer_format_ptr) = WMBUS_FORMAT_B;

                    } else {
                        /* here there is an error and we should stop reception */
                        /* Clear the IRQ flag */
                        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
                        wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_C_MODE, ((vectcRadioBuff[0] << 8) | vectcRadioBuff[1]), 0, 0);
#endif

                        __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                        wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

#ifdef WMBUS_NO_BLOCKING_HAL
                        WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
#endif

                        // Sabort_Cmd_Prog = 1;
                        return;
                    }

                } else
                /* here it is supposed to be T-mode */
                {
                    /* saved Sync word (T-mode) */
                    RxSync_Ongoing = WMBUS_SYNC_PATTERN_T_MODE_M2O;
                    *(HAL_buffer_format_ptr) = Hal_MrSubGhz_Frame_format;
                }

