STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
                /* now we have to check L-field consistency */

                /* decode L-field using 3o6 Sw decoding */
                if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O) {
                    uint8_t tos_in[3], tos_out[2];

                    for (uint8_t j = 0; j < 3; j++) {
                        // tos_in[2-j]=RxBuffQueue[(RxQueueHead+j)%RX_QUEUE_SIZE];
                        tos_in[j] = vectcRadioBuff[j];
                    }

                    ToS_decode(tos_in, tos_out);
                    cLField = tos_out[0];
                } else {
                    /* in that case C-mode and NRZ encoded - L-field is in 3rd byte - 2 1st bytes are Sync pattern */
                    cLField = vectcRadioBuff[2];
                }

                /* L should be at least 10 (C-field+M-field+A-field+CI-field),
                if not Sabort Rx */
                if (cLField < 10) {
                    /* Clear the IRQ flag */
                    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_L_FIELD, cLField, RxSync_Ongoing, 0);
#endif
                    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif
#ifdef WMBUS_NO_BLOCKING_HAL
                    WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
#endif

                    // Sabort_Cmd_Prog = 1;
                    return;
                }

                /* now need to compute length of Wm-Bus packet / buffer */
                /* as T1C1_ACTIVATED enabled we don't know frame format in case C-mode => we have to check it based on RxSync_Ongoing info */
                if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A)) {
                    nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
                } else if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_B)) {
                    nPcktLength = 1 + cLField;
                } else if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) {
                    nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
                } else if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B) {
                    nPcktLength = 1 + cLField;
                    ;
                }

                /* here we have to take care 3o6 case where radio buffer is 50% longer */
                if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O)) {
                    nPcktLengthRaw = nPcktLength * 3;

                    if (nPcktLengthRaw % 2 == 0)
                        nPcktLengthRaw /= 2;
                    else
                        nPcktLengthRaw = (nPcktLengthRaw + 1) / 2;

#ifdef WMBUS_FIRST_CRC_CHECK
                    if (nPcktLengthRaw < WMBUS_FIRST_RXBUFFER_THRESHOLD) {
                        LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
                    } else {
                        LL_MRSubG_SetAlmostFullThresholdRx(nPcktLengthRaw);
                    }
#else
                    LL_MRSubG_SetAlmostFullThresholdRx(nPcktLengthRaw);
#endif

                } else /* default case for nPcktLength buffer IRQ */
                {
                    /* update 2nd Rx buffer threshold with +2 as 2 1st bytes are C-mode Sync */
#ifdef WMBUS_FIRST_CRC_CHECK
                    if (nPcktLength + 2 < WMBUS_FIRST_RXBUFFER_THRESHOLD) {
                        LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
                    } else {
                        LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 2);
                    }
#else
                    LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 2);
#endif
                }
#ifdef WMBUS_FIRST_CRC_CHECK
                if (!wmbphy_first_CRC_check()) {
                    /* if 1st CRC check is failed then stop Rx ASAP */

                    /* Clear the IRQ flag before return*/
                    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_FIRST_CRC_ERROR, cLField, Hal_MrSubGhz_Frame_format, 0);
#endif

                    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif
#ifdef WMBUS_NO_BLOCKING_HAL
                    WmBus_Radio_Event_bitmap |= WMBUS_FIRST_CRC_ERROR;
#endif
                    return;

                } else {
#endif

                    /* update 2nd Rx buffer threshold */
                    // LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
                    xRxState = SM_RX_LAST;
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_FISRT_PROCESSING, nPcktLength, RxSync_Ongoing, RssiOnSync);
#endif
#ifdef WMBUS_FIRST_CRC_CHECK
                }
#endif

            } /*end if ((Hal_MrSubGhz_WmBus_mode == C_MODE) || (Hal_MrSubGhz_WmBus_mode == T_MODE)) */
            /* this case can happen */
            else if ((Hal_MrSubGhz_WmBus_mode == S1M_MODE) || (Hal_MrSubGhz_WmBus_mode == S_MODE)) {
                /* extract L-field */
                cLField = vectcRadioBuff[0];

                if (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A) {
                    nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
                    *(HAL_buffer_format_ptr) = WMBUS_FORMAT_A;
                }
                if (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_B) {
                    nPcktLength = 1 + cLField;
                    *(HAL_buffer_format_ptr) = WMBUS_FORMAT_B;
                }

                /* L should be at least 10 or 11 depending frame format, otherwise abort */
                if (((cLField < 10) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A)) || ((cLField < 11) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_B))) {
                    /* Clear the IRQ flag before return*/
                    MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_L_FIELD, cLField, Hal_MrSubGhz_Frame_format, 0);
#endif

                    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif
#ifdef WMBUS_NO_BLOCKING_HAL
                    WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
#endif
                    return;
                    // Sabort_Cmd_Prog = 1;
                } else {

