STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
#ifdef WMBUS_FIRST_CRC_CHECK
                    if (!wmbphy_first_CRC_check()) {
                        /* if 1st CRC check is failed then stop Rx ASAP */

                        /* Clear the IRQ flag before return*/
                        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;

#ifdef WMBUS_DEBUG
                        wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_FIRST_CRC_ERROR, cLField, Hal_MrSubGhz_Frame_format, 0);
#endif

                        __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
                        wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif
#ifdef WMBUS_NO_BLOCKING_HAL
                        WmBus_Radio_Event_bitmap |= WMBUS_FIRST_CRC_ERROR;
#endif
                        return;

                    } else {
#endif

                        /* update 2nd Rx buffer threshold */
#ifdef WMBUS_FIRST_CRC_CHECK
                        if (nPcktLength < WMBUS_FIRST_RXBUFFER_THRESHOLD) {
                            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
                        } else {
                            LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
                        }
#else
                    LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
#endif

                        xRxState = SM_RX_LAST;

#ifdef WMBUS_DEBUG
                        wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_FISRT_PROCESSING, (uint32_t)nPcktLength, (uint32_t)RxSync_Ongoing, (uint32_t)RssiOnSync);
#endif
#ifdef WMBUS_FIRST_CRC_CHECK
                    }
#endif
                }
            }
#endif
        } else if (xRxState == SM_RX_LAST) {
            /* stop Rx - all packet bytes have been received */
            // delay Sabort
            //__HAL_MRSUBG_STROBE_CMD(CMD_SABORT);

            xRxDoneFlag = SET;

#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE)
            /* here need to re-format RxBuffer to be compliant with
            wmbphy_wait_Rx_completed()
            wmbphy_wait_Rx_CRC_mngt()
            => using same Radio buffer*/

            if ((Hal_MrSubGhz_WmBus_mode == C_MODE) || (Hal_MrSubGhz_WmBus_mode == T_MODE)) {
                uint16_t i = 0;

                /* T1C1 C-mode case : copy by shifting bytes by -2 */
                if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) || (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B)) {
                    /* nPcktLength NRZ bytes to copy */
                    for (i = 0; i < nPcktLength; i++) {
                        vectcRadioBuff_copy[i] = vectcRadioBuff[i + 2];
                    }

                }

                /* T1C1 T-mode case : 3o6 decoding + copy (into same buffer) */
                else if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O)) {
                    /* 3o6 decoding until nPcktLengthRaw */
                    uint16_t tos_q_tgt = nPcktLengthRaw;

                    tos_q_head = 0;  // 1st 3o6 RAW byte to decode
                    tos_q_tail = 0;  // 1st decoded byte to write

                    /* indexes of RAW 3o6 buffer */
                    tos_q_done_head = 0;

                    while (tos_q_done_head < tos_q_tgt) {
                        ToS_decode(&vectcRadioBuff[tos_q_head], tos_out);

                        tos_q_head = tos_q_head + 3;
                        tos_q_done_head += 3;

                        for (uint8_t j = 0; j < 2; j++) {
                            vectcRadioBuff_copy[tos_q_tail] = tos_out[j];
                            tos_q_tail++;
                        }
                    }

                } else /* default case : simply copy Radio buffer as is */
                {
                    /* nPcktLength NRZ bytes to copy */
                    for (i = 0; i < nPcktLength; i++) {
                        vectcRadioBuff_copy[i] = vectcRadioBuff[i];
                    }
                }

            } /* end if ((Hal_MrSubGhz_WmBus_mode == C_MODE) || (Hal_MrSubGhz_WmBus_mode == T_MODE)) */
            else if ((Hal_MrSubGhz_WmBus_mode == S1M_MODE) || (Hal_MrSubGhz_WmBus_mode == S_MODE)) {
                uint16_t i = 0;

                /* nPcktLength NRZ bytes to copy */
                for (i = 0; i < nPcktLength; i++) {
                    vectcRadioBuff_copy[i] = vectcRadioBuff[i];
                }
            }
#else /* T1C1_ACTIVATED */

            uint16_t i = 0;

#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
            /* nPcktLength NRZ bytes to copy */
            for (i = 0; i < nPcktLength; i++) {
                vectcRadioBuff_copy[i] = vectcRadioBuff[i];
            }
#else
            /* nPcktLength NRZ bytes to copy */
            /* we have to verify which mode as automatic detection applies only to C-mode */
            if ((Hal_MrSubGhz_WmBus_mode == C_MODE) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A_B)) {
                for (i = 0; i < nPcktLength; i++) {
                    vectcRadioBuff_copy[i] = vectcRadioBuff[i + 1];
                }
            } else {
                for (i = 0; i < nPcktLength; i++) {
                    vectcRadioBuff_copy[i] = vectcRadioBuff[i];
                }
            }

#endif

#endif

#ifdef WMBUS_DEBUG
            wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_LAST_PROCESSING, nPcktLength, RxSync_Ongoing, RssiOnSync);
#endif

#ifdef WMBUS_NO_BLOCKING_HAL
            WmBus_Radio_Event_bitmap |= WMBUS_RX_COMPLETED_WITH_RAW_BUFFER;

#ifndef WMBUS_CRC_IN_HAL
            /* call to Rx function directly */
            *(HAL_buffer_size_ptr) = wmbphy_wait_Rx_completed(HAL_buffer_ptr, HAL_RssiDbm_ptr, HAL_WmBus_RxSync_ptr);
#else
            *(HAL_buffer_size_ptr) = wmbphy_wait_Rx_CRC_mngt(HAL_buffer_ptr, HAL_RssiDbm_ptr, *(HAL_buffer_format_ptr), HAL_WmBus_RxSync_ptr);
#endif

#endif
        }

#if 0
    if (Sabort_Cmd_Prog ==1)
    {
      
      __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
      wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG,0,0,0);
#endif
      Sabort_Cmd_Prog = 0;
      
