STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
    }
#endif

        /* Clear the IRQ flag */
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F;
    }

    /* check this case even if it shouldn't happen */
    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F) {
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F;

#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
        /* Call this API after RX */
        revertFrequencyBaseFor169();
#endif
#endif

#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_IRQ_RX_DONE_LOG, 0, 0, 0);
#endif

#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_OVERFLOW_ERROR;
#endif

#ifdef IS_169MHZ
#ifdef ADJUST_FREQUENCY_169MHZ
        /* Call this API before RX */
        adjustFrequencyBaseFor169();
#endif
        /* Restart RX */
        FEM_Operation(FEM_RX);
#endif

        /* re-start Rx */
        __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_COMMAND_RX_CONTINUOUS_LOG, 0, 0, 0);
#endif
    }

#ifdef PREAMBLE_AND_SYNC_IRQ_ENABLE
    /* check this case even if it shouldn't happen */
    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F) {
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F;

#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_SYNC_DETECTED;
#endif
    }

    /* check this case even if it shouldn't happen */
    if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F) {
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS = MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F;

#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_VALID_PREAMBLE_DETECTED;
#endif
    }
#endif
}

/**
 * @brief   Wait for transmission to be completed
 * @note    Blocking call
 * @return  uint8_t status
 */
uint8_t wmbphy_wait_Tx_completed(void) {
    while (!xTxDoneFlag);

    return 1;
}

/**
 * @brief   Wait for reception to be completed
 * @note    Blocking call
 * @return  uint16_t nPcktLength length of received packet
 */
uint16_t wmbphy_wait_Rx_completed(uint8_t *LL_RxBuffer, int32_t *RssiDbm, uint32_t *RxSync) {
    while (!xRxDoneFlag);

    xRxDoneFlag = RESET;

    /* now copy Radio buffer into LL buffer */
    uint16_t i = 0;
    /* check length of LL buffer */
    // if (*HAL_buffer_size_ptr < nPcktLength)
    if (HAL_buffer_allocation < nPcktLength) {
        /* in that case LL buffer is too small */
        /* just set *HAL_buffer_size_ptr = 0xFFFF and don't copy data to avoid memory corruption */
        *HAL_buffer_size_ptr = 0xFFFF;

    } else {
        for (i = 0; i < nPcktLength; i++) {
            *(LL_RxBuffer) = vectcRadioBuff_copy[i];
            LL_RxBuffer++;
        }
    }

    /* save RssiOnSync level and stop (and Start Rx) */
    RssiRxDone = RssiOnSync;

    /* save Sync Word used for Rx */
    RxSync_RxDone = RxSync_Ongoing;

    /* now send Sabort command and reset variables */
    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

    *RssiDbm = wmbphy_ConvertRssiToDbm(RssiRxDone);
    *RxSync = RxSync_RxDone;

    return nPcktLength;
}

#ifdef WMBUS_CRC_IN_HAL
/**
 * @brief   Wait for reception to be completed with CRC management
 * @note    Blocking call
 *          This function is defined only if WMBUS_CRC_IN_HAL is defined
 * @return  uint16_t nPcktLength length of received packet
 */
uint16_t wmbphy_wait_Rx_CRC_mngt(uint8_t *LL_RxBuffer, int32_t *RssiDbm, uint8_t FrameFormat, uint32_t *RxSync) {
    /* CRC result */
    uint8_t xCrcResult;

    /* remaining bytes to analyze */
    uint16_t dataBytesRemaining;

    /* packet length without CRC */
    uint16_t nPcktLength_no_CRC;

    /* store start of buffer */
    uint8_t *pStartBuffer = LL_RxBuffer;

    while (!xRxDoneFlag);

    xRxDoneFlag = RESET;

    /* now copy Radio buffer into LL buffer to release Radio buffer */
    uint16_t i = 0;
    uint8_t j;

    /* nPcktLength computed during packet reception SM */
    // if (*HAL_buffer_size_ptr < nPcktLength)
    if (HAL_buffer_allocation < nPcktLength) {
        /* in that case LL buffer is too small */
        /* just set nPcktLength = 0xFFFF and don't copy data to avoid memory corruption */
        nPcktLength = 0xFFFF;
#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_BUFFER_SIZE_ERROR;
#endif

    } else {
        if (nPcktLength > WMBUS_RADIO_BUFFER_SIZE_MAX_3O6) {
            nPcktLength = 0xFFFF;
#ifdef WMBUS_NO_BLOCKING_HAL
            WmBus_Radio_Event_bitmap |= WMBUS_RX_OVERFLOW_ERROR;
#endif
        } else {
            for (i = 0; i < nPcktLength; i++) {
                *(LL_RxBuffer) = vectcRadioBuff_copy[i];
                LL_RxBuffer++;
            }
        }
    }

    /* save RssiOnSync level and stop (and Start Rx) */
    RssiRxDone = RssiOnSync;

    /* save Sync Word used for Rx */
    RxSync_RxDone = RxSync_Ongoing;

    /* now send Sabort command and reset variables */
    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

    *RssiDbm = wmbphy_ConvertRssiToDbm(RssiRxDone);
    *RxSync = RxSync_RxDone;

    /* check CRCs only if nPcktLength is consistent */
    if (nPcktLength != 0xFFFF) {
        /* as this point we can analyze Wm-Bus CRCs - depends on Frame Format info
           or if dynamic frame format detection rely on RxSync_RxDone */
        /* different cases to consider */
        if (FrameFormat == WMBUS_FORMAT_A) {
            /* CRC verification */
            xCrcResult = TRUE;

            /* check 1st block CRC */
            xCrcResult = wmbphy_CRC_check(pStartBuffer, pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2);

            /* update pStartBuffer ptr */
            pStartBuffer = pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_A;

            /* update buffer size without CRC */
            nPcktLength_no_CRC = WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2;

            /* update remaining bytes to analyze */
            dataBytesRemaining = nPcktLength - WMBUS_FIRST_BLOCK_SIZE_FORMAT_A;

            /* check CRCs of each block fully filled (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes) */
            for (uint16_t i = 0; i < (nPcktLength - WMBUS_FIRST_BLOCK_SIZE_FORMAT_A) / WMBUS_BLOCK_SIZE_FORMAT_A; i++) {
                xCrcResult &= wmbphy_CRC_check(pStartBuffer, pStartBuffer + WMBUS_BLOCK_SIZE_FORMAT_A - 2);

                /* copy/shift by 2 bytes in buffer without CRCs - to LL*/
                for (j = 0; j < WMBUS_BLOCK_SIZE_FORMAT_A - 2; j++) {
                    *(pStartBuffer - 2 + j) = *(pStartBuffer + j);
                }

                /* update pointer */
                pStartBuffer = pStartBuffer + WMBUS_BLOCK_SIZE_FORMAT_A;

                nPcktLength_no_CRC = nPcktLength_no_CRC + WMBUS_BLOCK_SIZE_FORMAT_A - 2;

                /* update remaining bytes to analyze */
                dataBytesRemaining = dataBytesRemaining - WMBUS_BLOCK_SIZE_FORMAT_A;
            }

            /* if last block has less than WMBUS_BLOCK_SIZE_FORMAT_A bytes */
            if ((nPcktLength - WMBUS_FIRST_BLOCK_SIZE_FORMAT_A) % WMBUS_BLOCK_SIZE_FORMAT_A != 0) {
                xCrcResult &= wmbphy_CRC_check(pStartBuffer, pStartBuffer + dataBytesRemaining - 2);

                /* copy/shift by 2 bytes in buffer without CRCs - to LL*/
                for (j = 0; j < dataBytesRemaining; j++) {
                    *(pStartBuffer - 2 + j) = *(pStartBuffer + j);
                }

                nPcktLength_no_CRC = nPcktLength_no_CRC + dataBytesRemaining - 2;
            }

        } else if (FrameFormat == WMBUS_FORMAT_B) {
            /* CRC verification */
            xCrcResult = TRUE;
            /* check if only second block or optional block to consider */
            if (nPcktLength <= (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B)) {
                /* here only 1st + 2nb block => 1 CRC to check */
                xCrcResult = wmbphy_CRC_check(pStartBuffer, pStartBuffer + nPcktLength - 2);
                nPcktLength_no_CRC = nPcktLength - 2;
            } else {
                /* here 2 CRCs to check : 2nd block + optional block */
                /* 2nd block CRC */
                xCrcResult = wmbphy_CRC_check(pStartBuffer, pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B - 2);
                /* optional block CRC */
                xCrcResult &= wmbphy_CRC_check(pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B, pStartBuffer + nPcktLength - 2);
                nPcktLength_no_CRC = nPcktLength - 4;
            }
        }
    }

    if ((xCrcResult) && (nPcktLength != 0xFFFF)) {
#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_COMPLETED_WITH_VALID_CRC;
#endif
#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_COMPLETED_WITH_VALID_CRC, nPcktLength, nPcktLength_no_CRC, 0);
#endif
        return nPcktLength_no_CRC;

    } else if (nPcktLength == 0xFFFF) {
#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_BUFFER_SIZE_ERROR;
#endif
#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_BUFFER_SIZE_ERROR, nPcktLength, nPcktLength_no_CRC, 0);
#endif
        return nPcktLength;

    } else {
#ifdef WMBUS_NO_BLOCKING_HAL
        WmBus_Radio_Event_bitmap |= WMBUS_RX_COMPLETED_WITH_CRC_ERROR;
#endif
#ifdef WMBUS_DEBUG
        wmbphy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_COMPLETED_WITH_CRC_ERROR, nPcktLength, nPcktLength_no_CRC, 0);
#endif
        return 0;
    }
}

