STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
#define CRC_POLYNOM 0x3D65

/**
 * @brief  Calculates the 16-bit CRC.
 * @note   This function is defined only if WMBUS_CRC_IN_HAL is defined
 * @param  crcReg Current or initial value of the CRC calculation
 * @param  crcData Data to perform the CRC-16 operation on.
 * @retval crcReg Updated CRC value
 */
uint16_t wmbphy_CRC_calc(uint16_t crcReg, uint8_t crcData) {
    uint8_t i;

    for (i = 0; i < 8; i++) {
        /* If upper most bit is 1 */
        if (((crcReg & 0x8000) >> 8) ^ (crcData & 0x80))
            crcReg = (crcReg << 1) ^ CRC_POLYNOM;
        else
            crcReg = (crcReg << 1);

        crcData <<= 1;
    }

    return crcReg;
}

/**
 * @brief  Check CRC of the data between the specified start and stop pointers.
 * @note   This function is defined only if WMBUS_CRC_IN_HAL is defined
 * @param  pStart Pointer to the start of the buffer.
 * @param  pStop Pointer to the end of the buffer.
 * @retval uint8_t CRC check result.
 */
uint8_t wmbphy_CRC_check(uint8_t *pStart, uint8_t *pStop) {
    uint16_t seed = 0x0000;

    while (pStart != pStop) {
        seed = wmbphy_CRC_calc(seed, *pStart);
        pStart++;
    }
    seed = ~seed;
    if ((pStop[0] == (uint8_t)(seed >> 8)) && (pStop[1] == (uint8_t)(seed))) {
        return TRUE;
    }
    return FALSE;
}

/**
 * @brief  Append CRC to the data between the specified start and stop pointers.
 * @note   This function is defined only if WMBUS_CRC_IN_HAL is defined
 * @param  pStart Pointer to the start of the buffer.
 * @param  pStop Pointer to the end of the buffer.
 * @retval None.
 */
void wmbphy_CRC_append(uint8_t *pStart, uint8_t *pStop) {
    uint16_t seed = 0x0000;
    while (pStart != pStop) {
        seed = wmbphy_CRC_calc(seed, *pStart);
        pStart++;
    }
    seed = ~seed;
    pStop[0] = (uint8_t)(seed >> 8);
    pStop[1] = (uint8_t)seed;
}
#endif

#ifdef WMBUS_NO_BLOCKING_HAL
/**
 * @brief  Check WmBus phy radio events based on the specified event mask.
 * @note   This function is defined only if WMBUS_NO_BLOCKING_HAL is defined
 * @param  WmBus_RadioEvent_Mask Mask of the radio events to check.
 * @retval uint8_t Status of the radio events (1 if set, 0 if not set).
 */
uint8_t wmbphy_check_radio_events(uint32_t WmBus_RadioEvent_Mask) {
    if ((WmBus_Radio_Event_bitmap & WmBus_RadioEvent_Mask) == WmBus_RadioEvent_Mask) {
        /* clear radio flag event */
        WmBus_Radio_Event_bitmap &= ~WmBus_RadioEvent_Mask;
        return 1;

    } else {
        return 0;
    }
}

/**
 * @brief  Register the lower layer (LL) buffer and its associated parameters.
 * @note   This function is defined only if WMBUS_NO_BLOCKING_HAL is defined
 * @param  LL_RxBuffer Pointer to the RX buffer.
 * @param  LL_PacketLength_ptr Pointer to the packet length.
 * @param  LL_FrameFormat_ptr Pointer to the frame format.
 * @param  LL_WmBus_RxSync_ptr Pointer to the WMBUS RX sync value.
 * @param  LL_WmBus_RssiDbm_ptr Pointer to the RSSI value in dBm.
 * @retval uint8_t check of LL register size vs Radio buffer size (1 if too small - error, 0 no error).
 */
uint8_t wmbphy_register_LL_buffer(uint8_t *LL_RxBuffer, uint16_t *LL_PacketLength_ptr, uint8_t *LL_FrameFormat_ptr, uint32_t *LL_WmBus_RxSync_ptr, int32_t *LL_WmBus_RssiDbm_ptr) {
    /* save LL Rx buffer pointer */
    HAL_buffer_ptr = LL_RxBuffer;
    /* save LL buffer size pointer - used to report packet size to LL*/
    HAL_buffer_size_ptr = LL_PacketLength_ptr;
    /* save LL buffer size (allocation) - used by HAL to avoid LL buffer corruption */
    HAL_buffer_allocation = *(LL_PacketLength_ptr);
    /* save LL format */
    HAL_buffer_format_ptr = LL_FrameFormat_ptr;

    /* save LL Rssi level of Rx buffer */
    HAL_RssiDbm_ptr = LL_WmBus_RssiDbm_ptr;

    /* report Rx Sync pattern used for Rx */
    HAL_WmBus_RxSync_ptr = LL_WmBus_RxSync_ptr;

    /* check LL register size vs Radio buffer size : if too small => error */
    if (*LL_PacketLength_ptr < WMBUS_RADIO_BUFFER_SIZE_MAX_NRZ) {
        /* error */
        return 1;
    } else {
        /* no error */
        return 0;
    }
}
#endif

/**
 * @brief  Start TX test mode.
 * @param  Tx_TestMode Test mode for TX.
 * @retval uint8_t Status of the TX test mode start.
 */
uint8_t wmbphy_start_Tx_test_mode(uint8_t Tx_TestMode) {
    uint8_t TM_success = 0;

    switch (Tx_TestMode) {
        case TX_TM_CW:

            /* set CW - no modulation */
            HAL_MRSubG_SetModulation(MOD_CW, 0);

            /* set Test Mode */
            LL_MRSubG_SetTXMode(TX_PN);

            TM_success = SUCCESS;

            /* IRQ Config */
            MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = 0;

            MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

            __HAL_MRSUBG_STROBE_CMD(CMD_TX);
#ifdef WMBUS_DEBUG
            wmbphy_trace_debug_log(DEBUG_COMMAND_TX_LOG, 0, 0, 0);
#endif

            break;

        case TX_TM_PN9:

            /* just set Test Mode (and keep same modulation as Wm-Bus channel) */
            LL_MRSubG_SetTXMode(TX_PN);

            TM_success = SUCCESS;

            /* IRQ Config */
            MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = 0;

            MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

            __HAL_MRSUBG_STROBE_CMD(CMD_TX);
#ifdef WMBUS_DEBUG
            wmbphy_trace_debug_log(DEBUG_COMMAND_TX_LOG, 0, 0, 0);
#endif
            break;

        default:

            TM_success = ERROR;
            break;
    }

    return TM_success;
}

/**
 * @brief  Stop TX test mode.
 * @retval uint8_t Status of the TX test mode stop.
 */
uint8_t wmbphy_stop_Tx_test_mode(void) {
    __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
    wmbphy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

    /* wait for SABORT IRQ confirmation */
    while (!xSabortCompletedFlag);

    xSabortCompletedFlag = RESET;

    return SUCCESS;
}

/**
 * @brief Sense the RSSI within the specified timeout period.
 * @note  Blocking call
 * @param  RxTimeoutMicrosec Timeout value for RX in microseconds.
 * @retval int32_t RSSI value in dBm.
 */
int32_t wmbphy_sense_rssi(uint32_t RxTimeoutMicrosec) {
    /* IRQ Config */
    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = 0;
    MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E;

    /* start Rx timer without any Stop condition */
    wmbphy_start_RxTimer(RxTimeoutMicrosec, 0);

    /* wait for Rx timeout event */
    while (!wmbphy_check_radio_events(WMBUS_RX_TIMEOUT));

    /* return Rssi Dbm value */
    return HAL_MRSubG_GetRssidBm();
}

#ifdef WMBUS_RX_PERFORMANCE_ENABLED
/**
 * @brief  Configure RX performance settings based on the specified mode and direction.
 * @note   This function is defined only if WMBUS_RX_PERFORMANCE_ENABLED is defined
 * @param  WmBus_mode mode of WmBus.
 * @param  WmBus_Direction Direction of WmBus
 * @retval None.
 */
void wmbphy_Rx_performance_settings(uint8_t WmBus_mode, uint8_t WmBus_Direction) {
    /* optimize RSSI threshold setting */
    MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR, WmBus_Rx_RssiThreshold[WmBus_mode][WmBus_Direction]);

