STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
    /* optimize Clock Recovery settings */
    WRITE_REG(MR_SUBG_RADIO->CLKREC_CTRL0, WmBus_Rx_ClkRec[WmBus_mode][WmBus_Direction][0]);
    WRITE_REG(MR_SUBG_RADIO->CLKREC_CTRL1, WmBus_Rx_ClkRec[WmBus_mode][WmBus_Direction][1]);

    /* set RSSI_FLT register */
    WRITE_REG(MR_SUBG_RADIO->RSSI_FLT, 0xE3);

    /* only validated for T/S/C and even N - 2-FSK 868MHz modes */
    /* optimize AFC3 register to avoid residual PER */
    WRITE_REG(MR_SUBG_RADIO->AFC3_CONFIG, 0xE9);

#ifdef IS_169MHZ

    /* activate CS blanking due to short preamble */
    // LL_wmbphy_set_CS_blanking(ENABLE);

    if (WmBus_mode == N_MODE_Ng) {
        /* specific AFC settings */
        WRITE_REG(MR_SUBG_RADIO->AFC0_CONFIG, 0x67);
        WRITE_REG(MR_SUBG_RADIO->AFC1_CONFIG, 0x00);
        WRITE_REG(MR_SUBG_RADIO->AFC2_CONFIG, 0x68);
        WRITE_REG(MR_SUBG_RADIO->AFC3_CONFIG, 0xA8);
    }

#endif
}
#endif

#ifdef WMBUS_ACTIVE_POWER_MODE_ENABLED
/**
 * @brief  Set the active power mode.
 * @note   This function is defined only if WMBUS_ACTIVE_POWER_MODE_ENABLED is defined
 * @param  Active_PM Active power mode.
 * @retval None.
 */
void wmbphy_set_active_power_mode(uint8_t Active_PM) {
    switch (Active_PM) {
        case WMBUS_LPM:
            /* in that case LPM means :
               - 1.2v SMPS
               - RF LDO bypassed
            */

            /* set SMPS level @ 1.2v */
            HAL_PWREx_ConfigSMPS_Update(LL_PWR_SMPS_OUTPUT_VOLTAGE_1V20, PWR_CR5_SMPSBOMSEL_1);

            /* bypass RF LDO */
            SET_BIT(PWR->CR2, PWR_CR2_RFREGBYP);

            break;

        case WMBUS_HPM:
            /* in that case HPM means :
               - 1.4v SMPS
               - RF LDO NOT bypassed
            */

            /* NOT bypass RF LDO */
            CLEAR_BIT(PWR->CR2, PWR_CR2_RFREGBYP);

            /* set SMPS level @ 1.4v */
            HAL_PWREx_ConfigSMPS_Update(LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40, PWR_CR5_SMPSBOMSEL_1);

            break;

        case WMBUS_SMPS_BYPASS_STATIC:

            LL_PWR_DBGSMPS_Current_Selection(0);

            SET_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_STATIC);
            SET_BIT(PWR->CR5, PWR_CR5_NOSMPS_BOF);

            break;

        default:

            break;
    }
}
#endif

#ifdef WMBUS_DEBUG
/**
 * @brief  Initialize debug log.
 * @note   This function is defined only if WMBUS_DEBUG is defined
 * @retval None.
 */
void wmbphy_initialize_debug_log(void) {
    uint8_t i = 0;

    for (i = 0; i < WMBUS_LOG_BUFFER_SIZE; i++) {
        MRSubG_WmBus_debug_log[i].Timestamp = 0;
        MRSubG_WmBus_debug_log[i].event = 0;
        MRSubG_WmBus_debug_log[i].debug_info1 = 0;
        MRSubG_WmBus_debug_log[i].debug_info2 = 0;
        MRSubG_WmBus_debug_log[i].debug_info3 = 0;
    }

    MRSubG_WmBus_debug_log_index = 0;
}

/**
 * @brief  Trace debug log.
 * @note   This function is defined only if WMBUS_DEBUG is defined
 * @param  event Event value to log.
 * @param  debug_info1 Debug information 1.
 * @param  debug_info2 Debug information 2.
 * @param  debug_info3 Debug information 3.
 * @retval None.
 */
void wmbphy_trace_debug_log(uint32_t event, uint32_t debug_info1, uint32_t debug_info2, uint32_t debug_info3) {
    MRSubG_WmBus_debug_log[MRSubG_WmBus_debug_log_index].Timestamp = HAL_GetTick();
    MRSubG_WmBus_debug_log[MRSubG_WmBus_debug_log_index].event = event;
    MRSubG_WmBus_debug_log[MRSubG_WmBus_debug_log_index].debug_info1 = debug_info1;
    MRSubG_WmBus_debug_log[MRSubG_WmBus_debug_log_index].debug_info2 = debug_info2;
    MRSubG_WmBus_debug_log[MRSubG_WmBus_debug_log_index].debug_info3 = debug_info3;

    MRSubG_WmBus_debug_log_index++;

    if (MRSubG_WmBus_debug_log_index == WMBUS_LOG_BUFFER_SIZE) {
        MRSubG_WmBus_debug_log_index = 0;
    }
}
#endif

#ifdef WMBUS_FIRST_CRC_CHECK
/**
 * @brief  Perform the first CRC check.
 * @note   This function is defined only if WMBUS_FIRST_CRC_CHECK is defined
 * @retval uint8_t Result of the CRC check, 0 if failed, 1 if passed.
 */
uint8_t wmbphy_first_CRC_check(void) {
    /* copy Radio Buffer into Copy buffer */
    uint8_t i = 0;

    if (Hal_MrSubGhz_Frame_format != WMBUS_FORMAT_B) {
        /* copy into vectcRadioBuff_copy[] for CRC analysis
           if T+C mode and T-mode then perform 3o6 decoding by Sw */

        /* check first cases where only single modes are selected */
#if !defined(T1C1_ACTIVATED) && !defined(T1C1_ACTIVATED_C1_MODE)
#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
        /* here no C-mode dynamic format, so copy directly NRZ bytes to vectcRadioBuff_copy[] */
        /* copy WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */
        for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++) {
            vectcRadioBuff_copy[i] = vectcRadioBuff[i];
        }
#else
        /* here C-mode dynamic format to handle - if it is the case */
        /* check if C-mode requested + A_B format only and A format detected
           (then copy starting from 2nd Rx byte - otherwise copy from 1st byte */
        /* copy using NRZ */
        /* copy WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */
        if ((Hal_MrSubGhz_WmBus_mode == C_MODE) && (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) && (Hal_MrSubGhz_Frame_format == WMBUS_FORMAT_A_B)) {
            for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++) {
                vectcRadioBuff_copy[i] = vectcRadioBuff[i + 1];
            }
        } else if ((Hal_MrSubGhz_WmBus_mode == C_MODE) && (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B)) {
            return 1;  // declare CRC Ok to not check CRC in case Frame Format B detected
        } else {
            /* other cases :
               - C-mode + A-format requested
               - S-mode
               - T-mode */
            for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++) {
                vectcRadioBuff_copy[i] = vectcRadioBuff[i];
            }
        }
#endif
#else  // here need to manage T+C modes : so we have to check effective Rx mode and frame format
        if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) {
            /* here C-mode dynamic format to handle - if it is the case */
            /* check if C-mode (then copy starting from 3rd Rx byte */
            /* copy using NRZ */
            /* cpoy WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */
            for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++) {
                vectcRadioBuff_copy[i] = vectcRadioBuff[i + 2];
            }
        } else if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O) {
            /* here T-mode format to handle - if it is the case */
            /* perform 3o6 Sw decoding 3 bytes in -> 2 bytes out to copy */
            /* output : WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */

