STMicroelectronics/stm32-mw-wmbus/Src/stm32wl3_wmbphy_radio.c
            uint16_t tos_q_tgt = WMBUS_FIRST_BLOCK_SIZE_FORMAT_A + 6;  // 12 NRZ bytes = 18 3o6 bytes

            tos_q_head = 0;  // 1st 3o6 RAW byte to decode
            tos_q_tail = 0;  // 1st decoded byte to write

            /* indexes of RAW 3o6 buffer */
            tos_q_done_head = 0;

            while (tos_q_done_head < tos_q_tgt) {
                ToS_decode(&vectcRadioBuff[tos_q_head], tos_out);  //

                tos_q_head = tos_q_head + 3;
                tos_q_done_head += 3;

                for (uint8_t j = 0; j < 2; j++) {
                    vectcRadioBuff_copy[tos_q_tail] = tos_out[j];
                    tos_q_tail++;
                }
            }
        } else
        /* other cases (S mode) : just copy NRZ bytes buffer to buffer */
        {
            for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++) {
                vectcRadioBuff_copy[i] = vectcRadioBuff[i];
            }
        }
#endif
        /* here vectcRadioBuff_copy[] is done with WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes */
        /* check CRC */
        /* CRC verification */
        /* CRC result */
        uint8_t xCrcResult = TRUE;

        /* check 1st block CRC */
        xCrcResult = wmbphy_CRC_check(&vectcRadioBuff_copy[0], &vectcRadioBuff_copy[WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2]);

        /* CRC OK if xCrcResult = 1
           CRC KO if xCrcResult = 0 */
        return xCrcResult;
    } else  // if (Hal_MrSubGhz_Frame_format != WMBUS_FORMAT_B)
    {
        /* do not check CRC for frame format B */
        return 1;
    }
}
#endif

/**
 * @}
 */

#endif /* WL3_WMBPHY_RADIO_ENABLED */

/**
 * @}
 */

/**
 * @}
 */
